app/controllers/hwm_studios_controller.rb

SELECT `hwm_studios`.* FROM `hwm_studios` WHERE (city = '' and tag = 0)
---
  def index
    @hwm_studios = HwmStudio.all

SELECT `hwm_studios`.* FROM `hwm_studios` WHERE `hwm_studios`.`id` = 1 LIMIT 1
---
  def show
    @hwm_studio = HwmStudio.find(params[:id])