app/controllers/hwm_management_organizations_controller.rb

  def index
    @hwm_management_organizations = HwmManagementOrganization.all
---
SELECT `hwm_management_organizations`.* FROM `hwm_management_organizations`