app/controllers/hwm_user_accounts_controller.rb

  def index
    @hwm_user_accounts = HwmUserAccount.all
---
SELECT COUNT(*) FROM `hwm_user_accounts` WHERE (hwm_user_account_role_id > 0)
SELECT `hwm_user_accounts`.* FROM `hwm_user_accounts` WHERE (hwm_user_account_role_id > 0 and js_tag = 0)

  def show
    @hwm_user_account = HwmUserAccount.find(params[:id])
---
SELECT "hwm_user_accounts".* FROM "hwm_user_accounts" WHERE "hwm_user_accounts"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @hwm_user_account = HwmUserAccount.new(params[:hwm_user_account])
    # 对用户密码进行md5加密
    require 'digest/md5'
    @hwm_user_account.encrypt_pwd =  Digest::MD5.hexdigest(@hwm_user_account.password)
    @vericode = params[:vericode]
    validate_result = validatecode @hwm_user_account.mobile @vericode



    respond_to do |format|
      if @hwm_user_account.save
---
INSERT INTO "hwm_user_accounts" ("certno", "certtype", "created_at", "email", "encrypt_pwd", "hwm_studio_id", "mobile", "nickname", "password", "realname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)