app/controllers/hwm_user_detail_infos_controller.rb

  def index
    @hwm_user_detail_infos = HwmUserDetailInfo.all
---
SELECT `hwm_user_detail_infos`.* FROM `hwm_user_detail_infos`